Repository: zatomos/KRAB
Catalog: lib/l10n/*.arb
Languages: fr

# welcome_title
source: Welcome to KRAB!
fr: Bienvenue sur KRAB!

# welcome_subtitle
source: To get the best experience, please review these quick settings.
fr: Afin d'obtenir la meilleure expérience, prenez un instant pour vérifier ces réglages.

# background_widget_description
source: To ensure that the widget updates properly, it is recommended to allow the app to run in the background.
fr: Afin de garantir que le widget se mette à jour correctement, il est recommandé d'autoriser l'application à s'exécuter en arrière-plan.

# background_widget_allow
source: Allow background activity
fr: Autoriser l'activité en arrière-plan

# go_button
source: Let's go!
fr: C'est parti!

# supabase_title
source: Connect to your database
fr: Connexion à votre base de données

# supabase_subtitle
source: KRAB uses Supabase to manage your data. Please ask your administrator for the connection details.
fr: KRAB utilise Supabase pour sauvegarder vos données. Veuillez demander les détails de connexion à votre administrateur.

source: Supabase URL
fr: Lien Supabase

# supabase_key
source: Supabase Anon Key
fr: Clé Anonyme Supabase

source: Connect!
fr: Connexion

# supabase_connection_success
source: Connection successful!
fr: Connexion réussie!

# supabase_connection_error
source: Connection error. Please check your details and try again.
fr: Erreur de connexion. Veuillez vérifier vos informations et réessayer.

source: Sign Up
fr: S'inscrire

source: Log In
fr: Se connecter

source: Log Out
fr: Se déconnecter

source: Username
fr: Nom d'utilisateur

source: Password
fr: Mot de passe

source: Confirm Password
fr: Confirmer le mot de passe

source: Passwords do not match.
fr: Les mots de passe ne correspondent pas.

# register_user_success
source: User registered successfully!
fr: Utilisateur enregistré avec succès!

# already_have_account
source: Already have an account? Log In
fr: Vous avez déjà un compte? Se connecter

# dont_have_account
source: Don't have an account? Sign Up
fr: Vous n'avez pas de compte? S'inscrire

# fill_in_all_fields
source: Please fill in all fields.
fr: Veuillez remplir tous les champs.

# account_page_title
source: My Account
fr: Mon Compte

source: Settings
fr: Paramètres

# auto_save_imgs
source: Automatically save images
fr: Enregistrement automatique des images

# auto_save_imgs_description
source: Images will be saved to your gallery when received.
fr: Les images seront enregistrées dans votre galerie lorsqu'elles seront reçues.

# image_sent_title
source: Image sent!
fr: Image envoyée!

# image_sent_subtitle
source: Your image has been sent to the selected groups.
fr: Votre image a été envoyée aux groupes sélectionnés.

# error_image_not_sent_title
source: Error sending image.
fr: Erreur lors de l'envoi de l'image.

# error_image_not_sent_subtitle
source: There was an error sending your image: {errorMsg}
fr: Une erreur est survenue lors de l'envoi de votre image: {errorMsg}

source: Select Groups
fr: Sélectionner des groupes

source: Failed to load groups.
fr: Échec du chargement des groupes.

# join_group_first
source: Please join a group first!
fr: Veuillez d'abord rejoindre un groupe!

# add_description
source: Add a description...
fr: Ajouter une description...

source: Cancel
fr: Annuler

source: Error
fr: Erreur

# select_at_least_one_group
source: Please select at least one group.
fr: Veuillez sélectionner au moins un groupe.

source: Send
fr: Envoyer

# image_saved_success
source: Image saved successfully!
fr: Image enregistrée avec succès!

source: Error saving image.
fr: Erreur lors de l'enregistrement de l'image.

source: Comments
fr: Commentaires

# comments_count
source: Comment ({count})
fr: Commentaires ({count})

# error_loading_images
source: Error loading images: {errorMsg}
fr: Erreur lors du chargement des images: {errorMsg}

# no_images
source: No images in this group (yet).
fr: Aucune image dans ce groupe (pour l'instant).

# group_settings_page_title
source: Group Settings
fr: Paramètres de Groupe

source: Leave Group
fr: Quitter le groupe

# left_group_success
source: Left group successfully.
fr: Groupe quitté avec succès.

# error_leaving_group
source: Failed to leave group: {errorMsg}
fr: Échec de la sortie du groupe: {errorMsg}

source: Edit Group Name
fr: Modifier le nom du groupe

source: New Group Name
fr: Nouveau nom du groupe

# group_name_empty
source: Group name cannot be empty.
fr: Le nom du groupe ne peut pas être vide.

# group_name_updated_success
source: Group name updated successfully.
fr: Nom du groupe mis à jour avec succès.

# error_updating_group_name
source: Error updating group name: {errorMsg}
fr: Erreur lors de la mise à jour du nom du groupe: {errorMsg}

source: Save
fr: Enregistrer

source: Delete Group
fr: Supprimer le groupe

# delete_group_confirmation
source: Are you sure you want to delete this group? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer ce groupe? Cette action est irréversible.

source: Delete
fr: Supprimer

# group_deleted_success
source: Group deleted successfully.
fr: Groupe supprimé avec succès.

# error_deleting_group
source: Error deleting group: {errorMsg}
fr: Erreur lors de la suppression du groupe: {errorMsg}

# group_code
source: Group Code: {code}
fr: Code du groupe: {code}

source: Members
fr: Membres

# no_members
source: No members found.
fr: Aucun membre trouvé.

# your_groups_page_title
source: Your Groups
fr: Vos Groupes

source: Create New Group
fr: Créer un nouveau groupe

source: Join Group
fr: Rejoindre un groupe

# error_loading_groups
source: Error loading groups: {errorMsg}
fr: Erreur lors du chargement des groupes: {errorMsg}

# no_group_joined
source: You haven't joined any groups yet.
fr: Vous n'avez rejoint aucun groupe pour l'instant.

# group_code_eight_chars
source: Group code must be 8 characters long.
fr: Le code du groupe doit comporter 8 caractères.

# group_code_invalid
source: Invalid group code: {errorMsg}
fr: Code de groupe invalide: {errorMsg}

# group_joined_success
source: Successfully joined group!
fr: Groupe rejoint avec succès!

source: Enter Group Code
fr: Entrez le code du groupe

source: Join
fr: Rejoindre

# group_name_empty_error
source: Group name cannot be empty.
fr: Le nom du groupe ne peut pas être vide.

# group_created_success
source: Group created successfully!
fr: Groupe créé avec succès!

# error_creating_group
source: Error creating group: {errorMsg}
fr: Erreur lors de la création du groupe: {errorMsg}

source: Create Group
fr: Créer un groupe

source: Enter Group Name
fr: Entrez le nom du groupe

source: Create
fr: Créer

# comment_added_success
source: Comment added successfully.
fr: Commentaire ajouté avec succès.

# error_adding_comment
source: Error adding comment: {errorMsg}
fr: Erreur lors de l'ajout du commentaire: {errorMsg}

# comment_updated_success
source: Comment updated successfully.
fr: Commentaire mis à jour avec succès.

# error_updating_comment
source: Error updating comment: {errorMsg}
fr: Erreur lors de la mise à jour du commentaire: {errorMsg}

# comment_deleted_success
source: Comment deleted successfully.
fr: Commentaire supprimé avec succès.

# error_deleting_comment
source: Error deleting comment: {errorMsg}
fr: Erreur lors de la suppression du commentaire: {errorMsg}

# no_comments
source: No comments yet.
fr: Aucun commentaire pour l'instant.

source: Loading...
fr: Chargement...

source: Edit
fr: Modifier

# edit_comment
source: Edit your comment...
fr: Modifier votre commentaire...

# post_comment
source: Post a comment...
fr: Publier un commentaire...

source: Error loading members
fr: Erreur lors du chargement des membres

# member_singular
source: member
fr: membre

# members_plural
source: members
fr: membres

# starred_groups_long_press
source: Starred groups will be automatically selected when sending images.
fr: Les groupes favoris seront automatiquement sélectionnés lors de l'envoi d'images.

# removed_group_favorites
source: Removed {groupName} from favorites.
fr: Retiré {groupName} des favoris.

# added_group_favorites
source: Added {groupName} to favorites.
fr: Ajouté {groupName} aux favoris.

source: Update Available
fr: Mise à jour disponible

# current_version
source: Current version: {currentVersion}
fr: Version actuelle : {currentVersion}

# update_required
source: This update is required.
fr: Cette mise à jour est obligatoire.

source: What's new:
fr: Changements:

# no_changelog
source: No changelog available.
fr: Aucun journal des modifications n'a été fourni.

# downloading
source: Downloading... {progress}%
fr: Téléchargement... {progress}%

source: Later
fr: Pas maintenant

source: Installing update...
fr: Mise à jour en cours...

# update_failed
source: Update failed. Please try again later.
fr: Échec de la mise à jour. Veuillez réessayer plus tard.

# update_check_failed
source: Failed to check for updates.
fr: Échec lors de la vérification des mises à jour.

source: Update Now
fr: Mettre à jour

source: Edit Username
fr: Modifier le nom d'utilisateur

# username_updated_success
source: Username updated successfully.
fr: Nom d'utilisateur mis à jour avec succès.

# error_updating_username
source: Error updating username: {errorMsg}
fr: Erreur lors de la mise à jour du nom d'utilisateur: {errorMsg}

# edit_pfp_title
source: Edit Profile Picture
fr: Modifier la photo de profil

# pfp_updated_success
source: Profile picture updated successfully.
fr: Photo de profil mise à jour avec succès.

# error_updating_pfp
source: Error updating profile picture: {errorMsg}
fr: Erreur lors de la mise à jour de la photo de profil: {errorMsg}

# pfp_deleted_success
source: Profile picture deleted successfully.
fr: Photo de profil supprimée avec succès.

# error_deleting_pfp
source: Error deleting profile picture: {errorMsg}
fr: Erreur lors de la suppression de la photo de profil: {errorMsg}

source: Crop Image
fr: Rogner l'image

source: Add
fr: Ajouter

# edit_icon_title
source: Edit Icon
fr: Modifier l'icône

# icon_updated_success
source: Icon updated successfully.
fr: Icône mise à jour avec succès.

# error_updating_icon
source: Error updating icon: {errorMsg}
fr: Erreur lors de la mise à jour de l'icône: {errorMsg}

# icon_deleted_success
source: Icon deleted successfully.
fr: Icône supprimée avec succès.

# error_deleting_icon
source: Error deleting icon: {errorMsg}
fr: Erreur lors de la suppression de l'icône: {errorMsg}

# promote_user
source: Promote to Admin
fr: Promouvoir en administrateur

# demote_user
source: Demote from Admin
fr: Rétrograder l'administrateur

source: Ban User
fr: Bannir

source: Unban User
fr: Débannir

source: Transfer Ownership
fr: Transférer le groupe

# promote_user_confirmation
source: Are you sure you want to promote this user to admin? They will be able to manage group settings and members.
fr: Êtes-vous certain de vouloir promouvoir cet utilisateur en tant qu'administrateur? Celui-ci pourra gérer les membres et les paramètres du groupe.

# demote_user_confirmation
source: Are you sure you want to demote this admin?
fr: Êtes-vous certain de vouloir rétrograder cet administrateur?

# ban_user_confirmation
source: Are you sure you want to ban this user from the group? They will no longer be able to access the group or its content.
fr: Êtes-vous certain de vouloir bannir cet utilisateur? Il ne pourra plus rejoindre ce groupe ou accéder à son contenu.

# unban_user_confirmation
source: Are you sure you want to unban this user? They will still need to join this group again.
fr: Êtes-vous certain de vouloir débannir cet utilisateur? Il devra rejoindre à nouveau le groupe pour accéder à son contenu.

# transfer_ownership_confirmation
source: Are you sure you want to transfer group ownership to this user? You will be demoted to an administrator.
fr: Êtes-vous certain de vouloir transférer la propriété du groupe à cet utilisateur? Vous serez rétrogradé au statut d'administrateur.

# user_role_updated_success
source: User role updated successfully.
fr: Rôle de l'utilisateur mis à jour avec succès.

# error_updating_user_role
source: Error updating user role: {errorMsg}
fr: Erreur lors de la mise à jour du rôle de l'utilisateur: {errorMsg}

source: Confirm
fr: Confirmer

# user_banned_success
source: User banned successfully.
fr: Utilisateur banni avec succès.

# error_banning_user
source: Error banning user: {errorMsg}
fr: Erreur lors du bannissement de l'utilisateur: {errorMsg}

# user_unbanned_success
source: User unbanned successfully.
fr: Utilisateur débanni avec succès.

# error_unbanning_user
source: Error unbanning user: {errorMsg}
fr: Erreur lors du débannissement de l'utilisateur: {errorMsg}

source: Just now
fr: Maintenant

# days_ago
source: {count}d
fr: {count}j

# weeks_ago
source: {count}w
fr: {count}sem

source: Add KRAB widget
fr: Ajouter le widget KRAB

# krab_widget_experience_desc
source: For the full experience, please add the KRAB home screen widget. This lets you see new images instantly on your home screen.
fr: Pour profiter de l'expérience complète, ajoutez le widget KRAB à votre écran d'accueil. Vous pourrez ainsi voir les dernières images postées directement depuis votre écran d'accueil.

source: Add widget
fr: Ajouter le widget

source: Widget Configuration
fr: Configuration du widget

# widget_configuration_desc
source: Choose widget display style:
fr: Choisissez le type d'affichage du widget

source: Image Only
fr: Image seulement

source: Image with Description
fr: Image et sa description

# widget_added_success
source: KRAB widget added successfully! You can find it on your home screen.
fr: Widget KRAB ajouté avec succès! Vous pouvez désormais le retrouver sur votre écran d'accueil.

source: Follow these steps:
fr: Suivez ces étapes :

# krab_widget_instruction_1
source: Go to your home screen
fr: Allez sur votre écran d'accueil

# krab_widget_instruction_2
source: Long-press on an empty area
fr: Appuyez longuement sur une zone vide

# krab_widget_instruction_3
source: Select 'Widgets' from the menu
fr: Selectionnez 'Widgets' dans le menu

# krab_widget_instruction_4
source: Find and add KRAB widget
fr: Trouvez et ajoutez le widget KRAB

# steps_vary_launcher
source: Steps may vary by launcher. Please refer to your launcher's instructions if needed.
fr: Les étapes peuvent varier selon le lanceur d'applications. Veuillez vous référer aux instructions de votre lanceur si nécessaire.

source: Got it!
fr: Compris!
